In [11]:
import pandas as pd

In [12]:
customers = pd.read_csv('Downloads/customers_wk9_thurs.csv')

In [13]:
products = pd.read_csv('Downloads/products_wk9_thurs.csv')

In [14]:
sales = pd.read_csv('Downloads/sales_wk9_thurs.csv')

In [15]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   sale_id           150 non-null    int64
 1   customer_id       150 non-null    int64
 2   product_id        150 non-null    int64
 3   transaction_date  150 non-null    object
 4   quantity          150 non-null    int64
 5   total_amount      150 non-null    float64
dtypes: float64(1), int64(4), object(1)
memory usage: 7.2+ KB

In [16]:
customers['registration_date'] = pd.to_datetime(customers['registration_date'])
sales

,sale_id,customer_id,product_id,transaction_date,quantity,total_amount
0,1,1,1,2022-02-10 14:30:00,1,79.99
1,2,2,3,2022-02-15 10:15:00,2,39.98
2,3,3,5,2022-02-20 16:45:00,1,34.99
3,4,4,2,2022-02-25 11:20:00,3,74.97
4,5,5,4,2022-03-01 13:10:00,1,89.99
...,...,...,...,...,...,...
145,146,86,30,2024-02-15 15:20:00,1,34.99
146,147,87,32,2024-02-20 11:30:00,3,83.97
147,148,88,34,2024-02-25 13:45:00,2,109.98
148,149,89,36,2024-03-01 16:15:00,1,29.99
149,150,90,38,2024-03-05 10:30:00,4,139.96

In [17]:
sales['transaction_date'] = pd.to_datetime(sales['transaction_date'])
products.head()

,product_id,product_name,category,price,launch_date,brand
0,1,Wireless Bluetooth Headphones,Electronics,79.99,2021-03-15,AudioTech
1,2,Organic Cotton T-Shirt,Clothing,24.99,2021-04-20,EcoWear
2,3,Stainless Steel Water Bottle,Home & Garden,19.99,2021-05-10,HydroLife
3,4,Leather Crossbody Bag,Accessories,89.99,2021-06-01,StyleCraft
4,5,Yoga Mat Premium,Sports & Outdoors,34.99,2021-06-15,FitZone

In [18]:
products['launch_date'] = pd.to_datetime(products['launch_date'])
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    60 non-null     int64
 1   product_name  60 non-null     object
 2   category      60 non-null     object
 3   price         60 non-null     float64
 4   launch_date   60 non-null     datetime64[ns]
 5   brand         60 non-null     object
dtypes: datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 2.9+ KB

In [19]:
sales['sales_year'] = sales['transaction_date'].dt.year
sales['sales_month'] = sales['transaction_date'].dt.month
sales['sales_day_of_week'] = sales['transaction_date'].dt.dayofweek
sales.head()

,sale_id,customer_id,product_id,transaction_date,quantity,total_amount,sales_year,sales_month,sales_day_of_week
0,1,1,1,2022-02-10 14:30:00,1,79.99,2022,2,3
1,2,2,3,2022-02-15 10:15:00,2,39.98,2022,2,1
2,3,3,5,2022-02-20 16:45:00,1,34.99,2022,2,6
3,4,4,2,2022-02-25 11:20:00,3,74.97,2022,2,4
4,5,5,4,2022-03-01 13:10:00,1,89.99,2022,3,1

In [20]:
sales['transaction_date'].min()

Timestamp('2022-02-10 14:30:00')

In [21]:
sales['transaction_date'].agg([max, min])

C:\Users\cmcda\AppData\Local\Temp\ipykernel_23428\1455432116.py:1: FutureWarning: The provided callable <built-in function max> is currently using Series.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  sales['transaction_date'].agg([max, min])
C:\Users\cmcda\AppData\Local\Temp\ipykernel_23428\1455432116.py:1: FutureWarning: The provided callable <built-in function min> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  sales['transaction_date'].agg([max, min])

max   2024-03-05 10:30:00
min   2022-02-10 14:30:00
Name: transaction_date, dtype: datetime64[ns]

In [22]:
grouped = sales.groupby(['transaction_date', 'quantity'])

In [23]:
sales.groupby('transaction_date')['quantity'].agg(['sum', 'max', 'count'])

                     sum  max  count
transaction_date
2022-02-10 14:30:00    1    1      1
2022-02-15 10:15:00    2    2      1
2022-02-20 16:45:00    1    1      1
2022-02-25 11:20:00    3    3      1
2022-03-01 13:10:00    1    1      1
...                  ...  ...    ...
2024-02-15 15:20:00    1    1      1
2024-02-20 11:30:00    3    3      1
2024-02-25 13:45:00    2    2      1
2024-03-01 16:15:00    1    1      1
2024-03-05 10:30:00    4    4      1

[150 rows x 3 columns]

In [24]:
sales['sales_day_of_week'].value_counts().head(1)

sales_day_of_week
4    24
Name: count, dtype: int64

In [25]:
sales['sales_month'].value_counts().head(1)

sales_month
2    16
Name: count, dtype: int64

In [26]:
sales['sales_year'].value_counts().sort_index()

sales_year
2022    65
2023    72
2024    13
Name: count, dtype: int64

In [27]:
grouped = products.groupby(['category', 'price'])

In [28]:
products.groupby('category')['price'].mean()

category
Accessories           35.073333
Clothing              52.240000
Electronics           59.990000
Home & Garden         30.156667
Sports & Outdoors    105.899091
Name: price, dtype: float64

In [29]:
products.groupby('category')['price'].max()

category
Accessories           89.99
Clothing              99.99
Electronics          149.99
Home & Garden         49.99
Sports & Outdoors    249.99
Name: price, dtype: float64

In [30]:
products.groupby('category')['price'].count()

category
Accessories          12
Clothing             12
Electronics          13
Home & Garden        12
Sports & Outdoors    11
Name: price, dtype: int64

In [31]:
grouped = customers.groupby(['state', 'age'])

In [32]:
customers.groupby('state')['age'].mean().round(1)

state
CA    34.1
FL    39.0
IL    37.2
NY    36.5
TX    38.3
Name: age, dtype: float64

In [33]:
grouped = sales.groupby(['customer_id', 'total_amount'])
sales.head()

,sale_id,customer_id,product_id,transaction_date,quantity,total_amount,sales_year,sales_month,sales_day_of_week
0,1,1,1,2022-02-10 14:30:00,1,79.99,2022,2,3
1,2,2,3,2022-02-15 10:15:00,2,39.98,2022,2,1
2,3,3,5,2022-02-20 16:45:00,1,34.99,2022,2,6
3,4,4,2,2022-02-25 11:20:00,3,74.97,2022,2,4
4,5,5,4,2022-03-01 13:10:00,1,89.99,2022,3,1

In [34]:
sales.groupby('customer_id')['total_amount'].sum()

customer_id
1     229.98
2     179.96
3     154.98
4     234.95
5     149.98
       ...
86     34.99
87     83.97
88    109.98
89     29.99
90    139.96
Name: total_amount, Length: 90, dtype: float64

In [35]:
sales.groupby('customer_id')['total_amount'].sum()

customer_id
1     229.98
2     179.96
3     154.98
4     234.95
5     149.98
       ...
86     34.99
87     83.97
88    109.98
89     29.99
90    139.96
Name: total_amount, Length: 90, dtype: float64

In [36]:
grouped = sales.groupby(['customer_id', 'sale_id'])

In [37]:
##3.2
most_purchases = sales.groupby('customer_id')['sale_id'].count()
most_purchases = most_purchases.sort_values(ascending=False).head()
most_purchases

customer_id
1    2
2    2
3    2
4    2
5    2
Name: sale_id, dtype: int64

In [38]:
sales.groupby('customer_id').size().sort_values(ascending=False).head(3)
sales.head()

,sale_id,customer_id,product_id,transaction_date,quantity,total_amount,sales_year,sales_month,sales_day_of_week
0,1,1,1,2022-02-10 14:30:00,1,79.99,2022,2,3
1,2,2,3,2022-02-15 10:15:00,2,39.98,2022,2,1
2,3,3,5,2022-02-20 16:45:00,1,34.99,2022,2,6
3,4,4,2,2022-02-25 11:20:00,3,74.97,2022,2,4
4,5,5,4,2022-03-01 13:10:00,1,89.99,2022,3,1

In [39]:
monthly_sales = sales.groupby(sales['transaction_date'].dt.to_period('M'))['total_amount'].sum()
monthly_sales

transaction_date
2022-02    229.93
2022-03    504.92
2022-04    415.90
2022-05    450.90
2022-06    502.84
2022-07    485.90
2022-08    376.87
2022-09    660.90
2022-10    493.90
2022-11    481.89
2022-12    730.85
2023-01    384.91
2023-02    750.87
2023-03    440.90
2023-04    508.87
2023-05    726.89
2023-06    483.84
2023-07    444.90
2023-08    493.87
2023-09    489.86
2023-10    741.90
2023-11    540.87
2023-12    727.86
2024-01    479.88
2024-02    688.86
2024-03    169.95
Freq: M, Name: total_amount, dtype: float64

In [40]:
#2.3.2 and 3.3?
daily_sales = sales.groupby(sales['transaction_date'].dt.dayofweek)['total_amount'].mean()
daily_sales

transaction_date
0     90.927500
1     74.028636
2     96.071905
3    102.267619
4    100.940833
5     61.121905
6     99.551429
Name: total_amount, dtype: float64

In [41]:
sales.head()

,sale_id,customer_id,product_id,transaction_date,quantity,total_amount,sales_year,sales_month,sales_day_of_week
0,1,1,1,2022-02-10 14:30:00,1,79.99,2022,2,3
1,2,2,3,2022-02-15 10:15:00,2,39.98,2022,2,1
2,3,3,5,2022-02-20 16:45:00,1,34.99,2022,2,6
3,4,4,2,2022-02-25 11:20:00,3,74.97,2022,2,4
4,5,5,4,2022-03-01 13:10:00,1,89.99,2022,3,1

In [42]:
merged = pd.merge(sales, products, on = 'product_id')
revenue = merged.groupby('category')['total_amount'].sum()
revenue

category
Accessories          2053.25
Clothing             2745.39
Electronics          3524.29
Home & Garden        1541.46
Sports & Outdoors    3544.64
Name: total_amount, dtype: float64

In [43]:
customers.groupby('state')['customer_id'].count()
sales

,sale_id,customer_id,product_id,transaction_date,quantity,total_amount,sales_year,sales_month,sales_day_of_week
0,1,1,1,2022-02-10 14:30:00,1,79.99,2022,2,3
1,2,2,3,2022-02-15 10:15:00,2,39.98,2022,2,1
2,3,3,5,2022-02-20 16:45:00,1,34.99,2022,2,6
3,4,4,2,2022-02-25 11:20:00,3,74.97,2022,2,4
4,5,5,4,2022-03-01 13:10:00,1,89.99,2022,3,1
...,...,...,...,...,...,...,...,...,...
145,146,86,30,2024-02-15 15:20:00,1,34.99,2024,2,3
146,147,87,32,2024-02-20 11:30:00,3,83.97,2024,2,1
147,148,88,34,2024-02-25 13:45:00,2,109.98,2024,2,6
148,149,89,36,2024-03-01 16:15:00,1,29.99,2024,3,4
149,150,90,38,2024-03-05 10:30:00,4,139.96,2024,3,1